In [1]:
# pip install pandas

In [2]:
import pandas as pd

In [3]:
# Video 18 done

In [31]:
# PANDAS SERIES

In [4]:
pd.__version__ # check version

'1.2.4'

In [6]:
list_s = [1,2, -3, 6.2,'data values']
print(list_s)

[1, 2, -3, 6.2, 'data values']

In [7]:
series1 = pd.Series(list_s) # create series
print(series1)

0              1
1              2
2             -3
3            6.2
4    data values
dtype: object

In [8]:
type(series1) # check type

pandas.core.series.Series

In [9]:
series2 = pd.Series([1,2,3,4]) # create series on short way
print(series2)

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
empty_s = pd.Series([]) # create empty series
print(empty_s)

Series([], dtype: float64)

<ipython-input-10-22accf230ce3>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  empty_s = pd.Series([]) # create empty series

In [12]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d']) # create series on short way with custom index. valu and index allwage should be equel
print(series3)

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d'],dtype= float) # create series on short way with custom index. valu and index allwage should be equel
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [14]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d'],dtype= float,name = 'data values') # create series on short way with custom index. valu and index allwage should be equel
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
Name: data values, dtype: float64

In [15]:
scalear_s = pd.Series(0.5)
print(scalear_s)

0    0.5
dtype: float64

In [16]:
scalear_s = pd.Series(0.5, index=[1,2,3])
print(scalear_s)

1    0.5
2    0.5
3    0.5
dtype: float64

In [17]:
dict_s = pd.Series({'a' : 1, 'b': 2})
print(dict_s)

a    1
b    2
dtype: int64

In [18]:
s4 = pd.Series([1,2,3,4,5])
print(s4)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [19]:
s4[0]

1

In [20]:
s4[3]

4

In [21]:
s4[0:3] # sliceing

0    1
1    2
2    3
dtype: int64

In [22]:
max(s4) # findoout max valu

5

In [23]:
min(s4) # find out min valu

1

In [24]:
s4[ s4 > 3 ] # find valu getter then 3

3    4
4    5
dtype: int64

In [25]:
s4

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [26]:
s5 = pd.Series([1,2,3,4,5])
print(s5)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [27]:
print(s4)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [28]:
s4 + s5

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [29]:
s6 = pd.Series([1,2,3])
print(s6)

0    1
1    2
2    3
dtype: int64

In [30]:
s5 + s6

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

In [33]:
# VIDEO 19 DONE

In [34]:
# PANDAS DATAFRAME

In [36]:
emt_df = pd.DataFrame() # Create empty dataframe
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [37]:
lst = ['a','b','c'] # Create list
print(lst)

['a', 'b', 'c']

In [39]:
df1 = pd.DataFrame(lst) # Create dataFrame from list
print(df1)

   0
0  a
1  b
2  c

In [40]:
df1

   0
0  a
1  b
2  c

In [41]:
ls_of_ls = [ [1,2,3],[2,3,4],[4,5,6] ]
print(ls_of_ls)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [42]:
df2 = pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [43]:
dict1 = {'ID' : [11,22,33,44]}
dict1

{'ID': [11, 22, 33, 44]}

In [45]:
df3 = pd.DataFrame(dict1) # create data frame use dicnarry
df3

   ID
0  11
1  22
2  33
3  44

In [49]:
dict1 = {'ID' : [11,22,33,44], 'SA' : [1,2,3,4]}
dict1

{'ID': [11, 22, 33, 44], 'SA': [1, 2, 3, 4]}

In [50]:
df3 = pd.DataFrame(dict1)
df3

   ID  SA
0  11   1
1  22   2
2  33   3
3  44   4

In [51]:
ls_dict = [{'a' : 1, 'b' : 2}, {'a': 3,'b': 4}]
ls_dict

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [53]:
df5 = pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [55]:
ls_dict = [{'a' : 1, 'b' : 2}, {'a': 3,'b': 4, 'c' : 5}]
df5 = pd.DataFrame(ls_dict)
df5

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [56]:
dict_sr = {'id' : pd.Series([1,2,3]), 'sa' : pd.Series([111,222,333])} # Create dataframe use dic of Series
df6 = pd.DataFrame(dict_sr)
df6

   id   sa
0   1  111
1   2  222
2   3  333

In [57]:
# VIDEO 20 DONE

In [58]:
# HOW TO READ CSV FILE IN PANDAS

In [59]:
pd.read_csv('Student_1.csv')

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [61]:
pd.read_csv('Top_10_it.csv')

  Top 10 IT Companies in india
0                          TCS
1                      Infosys
2                Tech Mahindra
3                        Wipro
4             HCL Technologies
5                 L&T Infotech
6                     Mindtree
7                      Mphasis
8    Oracle Financial Services
9                  Rotla India

In [62]:
import os

In [63]:
print(os.getcwd()) # to show our working dic

i:\All Gide Bank\ARTIFICIAL_INTELLIGENCE_Gide_Bank\MACHINE_LEARNING_GIDE_BANK\PANDAS

In [64]:
# VIDEO 21 DONE

In [65]:
# HOW TO WRITE CSV FILE IN PANDAS

In [68]:
df = pd.read_csv('Fortune_10.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [69]:
type(df) # to chack type

pandas.core.frame.DataFrame

In [70]:
df.columns # print colum name

Index(['ID', 'Name', 'Industry', 'Inception', 'Revenue', 'Expenses', 'Profit',
       'Growth'],
      dtype='object')

In [71]:
df = pd.read_csv('Fortune_10.csv', nrows= 1 ) # print spacipic row
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%

In [72]:
df = pd.read_csv('Fortune_10.csv', nrows= 5 ) # print 5 row
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%

In [74]:
df = pd.read_csv('Fortune_10.csv', usecols= [0] ) # print spacipic col / valu will be on list
df

   ID
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [75]:
df = pd.read_csv('Fortune_10.csv', usecols= [0,1] ) # print spacipic col / valu will be on list
df

   ID             Name
0   1          Lamtone
1   2        Stripfind
2   3  Canecorporation
3   4         Mattouch
4   5        Techdrill
5   6         Techline
6   7          Cityace
7   8   Kayelectronics
8   9          Ganzlax
9  10      Trantraxlax

In [76]:
df = pd.read_csv('Fortune_10.csv', usecols= [2,4,7] ) # print importent col / valu will be on list
df

              Industry       Revenue Growth
0          IT Services  $11,757,018     30%
1   Financial Services  $11,757,018     20%
2               Health  $11,757,018      7%
3          IT Services  $11,757,018     26%
4               Health  $11,757,018      8%
5               Health  $11,757,018     23%
6               Health  $11,757,018      6%
7               Health  $11,757,018      4%
8          IT Services  $11,757,018     18%
9  Government Services  $11,757,018      7%

In [77]:
df = pd.read_csv('Fortune_11.csv') # on this file first row is heading
df

,0,1,2,3,4,5,6,7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [78]:
df = pd.read_csv('Fortune_11.csv',skiprows= 1) # to skip 1st row
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [79]:
df = pd.read_csv('Fortune_11.csv',skiprows= 2) # to skip 2 row
df

,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
0,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
1,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
2,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
3,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
4,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
5,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
6,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
7,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
8,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [81]:
df = pd.read_csv('Fortune_11.csv',skiprows= [0])  # skip use index
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [82]:
df = pd.read_csv('Fortune_11.csv',skiprows= [2])  # skip use index
df

,0,1,2,3,4,5,6,7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [83]:
df = pd.read_csv('Fortune_11.csv',skiprows= [1,2,3])  # skip multi row use index
df

,0,1,2,3,4,5,6,7
0,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
1,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
2,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
3,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
4,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
5,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
6,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
7,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [84]:
df = pd.read_csv('Fortune_10.csv')  
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [85]:
df = pd.read_csv('Fortune_10.csv',index_col='ID')   # chenge index
df

,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
ID,,,,,,,
1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [86]:
df = pd.read_csv('Fortune_10.csv',index_col='Name')   # make name into index
df

,ID,Industry,Inception,Revenue,Expenses,Profit,Growth
Name,,,,,,,
Lamtone,1,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
Stripfind,2,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
Canecorporation,3,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
Mattouch,4,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
Techdrill,5,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
Techline,6,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
Cityace,7,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
Kayelectronics,8,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
Ganzlax,9,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
Trantraxlax,10,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [87]:
df = pd.read_csv('Fortune_10.csv',index_col= 2)   # chenge index in industy
df

,ID,Name,Inception,Revenue,Expenses,Profit,Growth
Industry,,,,,,,
IT Services,1,Lamtone,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
Financial Services,2,Stripfind,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
Health,3,Canecorporation,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
IT Services,4,Mattouch,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
Health,5,Techdrill,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
Health,6,Techline,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
Health,7,Cityace,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
Health,8,Kayelectronics,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
IT Services,9,Ganzlax,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
Government Services,10,Trantraxlax,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [ ]:
# VIDEO 22 DONE